{
  "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#deviceManagement/deviceCompliancePolicies/$entity",
  "@odata.type": "#microsoft.graph.androidCompliancePolicy",
  "id": "7fb990e5-3d77-1b36-ba31-9d1fa4908776",
  "createdDateTime": "2020-05-05T13:55:39.2945133Z",
  "description": "900f8baa-812e-4886-a598-61f73001bae8",
  "lastModifiedDateTime": "2020-05-05T13:55:39.2945133Z",
  "displayName": "Default compliance policy for Android",
  "version": 1,
  "passwordRequired": false,
  "passwordMinimumLength": null,
  "passwordRequiredType": "deviceDefault",
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordPreviousPasswordBlockCount": null,
  "securityPreventInstallAppsFromUnknownSources": false,
  "securityDisableUsbDebugging": false,
  "securityRequireVerifyApps": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": null,
  "storageRequireEncryption": false,
  "securityRequireSafetyNetAttestationBasicIntegrity": false,
  "securityRequireSafetyNetAttestationCertifiedDevice": false,
  "securityRequireGooglePlayServices": false,
  "securityRequireUpToDateSecurityProviders": false,
  "securityRequireCompanyPortalAppIntegrity": false,
  "assignments": []
}