{
  "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#deviceManagement/deviceConfigurations/$entity",
  "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
  "id": "df85068b-a6d7-45af-8453-2c4047d9a341",
  "lastModifiedDateTime": "2020-05-15T16:53:19.6284213Z",
  "createdDateTime": "2020-05-15T16:53:19.1586165Z",
  "description": null,
  "displayName": "Windows 10",
  "version": 2,
  "networkProxyApplySettingsDeviceWide": false,
  "networkProxyDisableAutoDetect": false,
  "networkProxyAutomaticConfigurationUrl": null,
  "networkProxyServer": null,
  "personalizationDesktopImageUrl": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fpngimg.com%2Fuploads%2Fuber%2Fuber_PNG24.png&imgrefurl=http%3A%2F%2Fpngimg.com%2Fimgs%2Flogos%2Fuber%2F&tbnid=-BEl5vLL61nFZM&vet=12ahUKEwjxhcbgqbbpAhURNa0KHZP1BvwQMygAegUIARC5AQ..i&docid=cmnsAUonGY3MwM&w=800&h=800&q=uber%20.png&ved=2ahUKEwjxhcbgqbbpAhURNa0KHZP1BvwQMygAegUIARC5AQ",
  "personalizationLockScreenImageUrl": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fpngimg.com%2Fuploads%2Fuber%2Fuber_PNG24.png&imgrefurl=http%3A%2F%2Fpngimg.com%2Fimgs%2Flogos%2Fuber%2F&tbnid=-BEl5vLL61nFZM&vet=12ahUKEwjxhcbgqbbpAhURNa0KHZP1BvwQMygAegUIARC5AQ..i&docid=cmnsAUonGY3MwM&w=800&h=800&q=uber%20.png&ved=2ahUKEwjxhcbgqbbpAhURNa0KHZP1BvwQMygAegUIARC5AQ",
  "bluetoothAllowedServices": [],
  "bluetoothBlockAdvertising": false,
  "bluetoothBlockDiscoverableMode": false,
  "bluetoothBlockPrePairing": false,
  "edgeBlockAutofill": false,
  "edgeBlocked": false,
  "edgeCookiePolicy": "userDefined",
  "edgeBlockDeveloperTools": false,
  "edgeBlockSendingDoNotTrackHeader": false,
  "edgeBlockExtensions": false,
  "edgeBlockInPrivateBrowsing": false,
  "edgeBlockJavaScript": false,
  "edgeBlockPasswordManager": false,
  "edgeBlockAddressBarDropdown": false,
  "edgeBlockCompatibilityList": false,
  "edgeClearBrowsingDataOnExit": false,
  "edgeAllowStartPagesModification": false,
  "edgeDisableFirstRunPage": false,
  "edgeBlockLiveTileDataCollection": false,
  "edgeSyncFavoritesWithInternetExplorer": false,
  "cellularBlockDataWhenRoaming": false,
  "cellularBlockVpn": false,
  "cellularBlockVpnWhenRoaming": false,
  "defenderRequireRealTimeMonitoring": false,
  "defenderRequireBehaviorMonitoring": false,
  "defenderRequireNetworkInspectionSystem": false,
  "defenderScanDownloads": false,
  "defenderScanScriptsLoadedInInternetExplorer": false,
  "defenderBlockEndUserAccess": false,
  "defenderSignatureUpdateIntervalInHours": null,
  "defenderMonitorFileActivity": "userDefined",
  "defenderDaysBeforeDeletingQuarantinedMalware": null,
  "defenderScanMaxCpu": null,
  "defenderScanArchiveFiles": false,
  "defenderScanIncomingMail": false,
  "defenderScanRemovableDrivesDuringFullScan": false,
  "defenderScanMappedNetworkDrivesDuringFullScan": false,
  "defenderScanNetworkFiles": false,
  "defenderRequireCloudProtection": false,
  "defenderCloudBlockLevel": "notConfigured",
  "defenderPromptForSampleSubmission": "userDefined",
  "defenderScheduledQuickScanTime": null,
  "defenderScanType": "userDefined",
  "defenderSystemScanSchedule": "userDefined",
  "defenderScheduledScanTime": null,
  "defenderDetectedMalwareActions": null,
  "defenderFileExtensionsToExclude": [],
  "defenderFilesAndFoldersToExclude": [],
  "defenderProcessesToExclude": [],
  "enterpriseCloudPrintDiscoveryEndPoint": null,
  "enterpriseCloudPrintOAuthAuthority": null,
  "enterpriseCloudPrintOAuthClientIdentifier": null,
  "enterpriseCloudPrintResourceIdentifier": null,
  "enterpriseCloudPrintDiscoveryMaxLimit": null,
  "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
  "lockScreenAllowTimeoutConfiguration": false,
  "lockScreenBlockActionCenterNotifications": false,
  "lockScreenBlockCortana": false,
  "lockScreenBlockToastNotifications": false,
  "lockScreenTimeoutInSeconds": null,
  "passwordBlockSimple": false,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinutesOfInactivityBeforeScreenTimeout": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordRequired": false,
  "passwordRequireWhenResumeFromIdleState": false,
  "passwordRequiredType": "deviceDefault",
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "privacyAdvertisingId": "notConfigured",
  "privacyAutoAcceptPairingAndConsentPrompts": false,
  "privacyBlockInputPersonalization": false,
  "searchBlockDiacritics": false,
  "searchDisableAutoLanguageDetection": false,
  "searchDisableIndexingEncryptedItems": false,
  "searchEnableRemoteQueries": false,
  "searchDisableIndexerBackoff": false,
  "searchDisableIndexingRemovableDrive": false,
  "searchEnableAutomaticIndexSizeManangement": false,
  "settingsBlockSettingsApp": false,
  "settingsBlockSystemPage": false,
  "settingsBlockDevicesPage": false,
  "settingsBlockNetworkInternetPage": false,
  "settingsBlockPersonalizationPage": false,
  "settingsBlockAccountsPage": false,
  "settingsBlockTimeLanguagePage": false,
  "settingsBlockEaseOfAccessPage": false,
  "settingsBlockPrivacyPage": false,
  "settingsBlockUpdateSecurityPage": false,
  "settingsBlockAppsPage": false,
  "settingsBlockGamingPage": false,
  "smartScreenEnableAppInstallControl": false,
  "startBlockUnpinningAppsFromTaskbar": false,
  "startMenuAppListVisibility": "userDefined",
  "startMenuHideChangeAccountSettings": false,
  "startMenuHideFrequentlyUsedApps": false,
  "startMenuHideHibernate": false,
  "startMenuHideLock": false,
  "startMenuHidePowerButton": false,
  "startMenuHideRecentJumpLists": false,
  "startMenuHideRecentlyAddedApps": false,
  "startMenuHideRestartOptions": false,
  "startMenuHideShutDown": false,
  "startMenuHideSignOut": false,
  "startMenuHideSleep": false,
  "startMenuHideSwitchAccount": false,
  "startMenuHideUserTile": false,
  "startMenuLayoutEdgeAssetsXml": null,
  "startMenuLayoutXml": null,
  "startMenuMode": "userDefined",
  "startMenuPinnedFolderDocuments": "notConfigured",
  "startMenuPinnedFolderDownloads": "notConfigured",
  "startMenuPinnedFolderFileExplorer": "notConfigured",
  "startMenuPinnedFolderHomeGroup": "notConfigured",
  "startMenuPinnedFolderMusic": "notConfigured",
  "startMenuPinnedFolderNetwork": "notConfigured",
  "startMenuPinnedFolderPersonalFolder": "notConfigured",
  "startMenuPinnedFolderPictures": "notConfigured",
  "startMenuPinnedFolderSettings": "notConfigured",
  "startMenuPinnedFolderVideos": "notConfigured",
  "diagnosticsDataSubmissionMode": "userDefined",
  "oneDriveDisableFileSync": false,
  "windowsSpotlightBlockConsumerSpecificFeatures": false,
  "windowsSpotlightBlocked": false,
  "windowsSpotlightBlockOnActionCenter": false,
  "windowsSpotlightBlockTailoredExperiences": false,
  "windowsSpotlightBlockThirdPartyNotifications": false,
  "windowsSpotlightBlockWelcomeExperience": false,
  "windowsSpotlightBlockWindowsTips": false,
  "windowsSpotlightConfigureOnLockScreen": "notConfigured",
  "accountsBlockAddingNonMicrosoftAccountEmail": false,
  "antiTheftModeBlocked": false,
  "bluetoothBlocked": false,
  "cameraBlocked": true,
  "connectedDevicesServiceBlocked": false,
  "certificatesBlockManualRootCertificateInstallation": false,
  "copyPasteBlocked": false,
  "cortanaBlocked": false,
  "deviceManagementBlockFactoryResetOnMobile": false,
  "deviceManagementBlockManualUnenroll": false,
  "safeSearchFilter": "userDefined",
  "edgeBlockPopups": false,
  "edgeBlockSearchSuggestions": false,
  "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
  "edgeSendIntranetTrafficToInternetExplorer": false,
  "edgeRequireSmartScreen": false,
  "edgeEnterpriseModeSiteListLocation": null,
  "edgeFirstRunUrl": null,
  "edgeHomepageUrls": [],
  "edgeBlockAccessToAboutFlags": false,
  "smartScreenBlockPromptOverride": false,
  "smartScreenBlockPromptOverrideForFiles": false,
  "webRtcBlockLocalhostIpAddress": false,
  "internetSharingBlocked": false,
  "settingsBlockAddProvisioningPackage": false,
  "settingsBlockRemoveProvisioningPackage": false,
  "settingsBlockChangeSystemTime": false,
  "settingsBlockEditDeviceName": false,
  "settingsBlockChangeRegion": false,
  "settingsBlockChangeLanguage": false,
  "settingsBlockChangePowerSleep": false,
  "locationServicesBlocked": false,
  "microsoftAccountBlocked": false,
  "microsoftAccountBlockSettingsSync": false,
  "nfcBlocked": false,
  "resetProtectionModeBlocked": false,
  "screenCaptureBlocked": false,
  "storageBlockRemovableStorage": false,
  "storageRequireMobileDeviceEncryption": false,
  "usbBlocked": false,
  "voiceRecordingBlocked": false,
  "wiFiBlockAutomaticConnectHotspots": false,
  "wiFiBlocked": false,
  "wiFiBlockManualConfiguration": false,
  "wiFiScanInterval": null,
  "wirelessDisplayBlockProjectionToThisDevice": false,
  "wirelessDisplayBlockUserInputFromReceiver": false,
  "wirelessDisplayRequirePinForPairing": false,
  "windowsStoreBlocked": false,
  "appsAllowTrustedAppsSideloading": "notConfigured",
  "windowsStoreBlockAutoUpdate": false,
  "developerUnlockSetting": "notConfigured",
  "sharedUserAppDataAllowed": false,
  "appsBlockWindowsStoreOriginatedApps": false,
  "windowsStoreEnablePrivateStoreOnly": false,
  "storageRestrictAppDataToSystemVolume": false,
  "storageRestrictAppInstallToSystemVolume": false,
  "gameDvrBlocked": false,
  "experienceBlockDeviceDiscovery": false,
  "experienceBlockErrorDialogWhenNoSIM": false,
  "experienceBlockTaskSwitcher": false,
  "logonBlockFastUserSwitching": false,
  "tenantLockdownRequireNetworkDuringOutOfBoxExperience": false,
  "edgeSearchEngine": {
    "@odata.type": "#microsoft.graph.edgeSearchEngine",
    "edgeSearchEngineType": "default"
  },
  "assignments": [
    {
      "id": "df85068b-a6d7-45af-8453-2c4047d9a341_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
      "target": {
        "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget"
      }
    },
    {
      "id": "df85068b-a6d7-45af-8453-2c4047d9a341_adadadad-808e-44e2-905a-0b7873a8a531",
      "target": {
        "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget"
      }
    }
  ]
}